package my.day07.c.random;

import java.util.Random;

public class Main_random_1 {

	public static void main(String[] args) {
		
		
		// === 랜덤한 정수를 뽑아낸다. === //
		double random = Math.random();
		System.out.println("random =>" + random);
		/*
		 	random =>0.16142210451898775
		 	random =>0.804307009396375
		 	random =>0.1910070815027859
			random =>0.6153496552586605

		 */
	
		
		/*
		  	java.lamg.Math.random() 메소드는
		  	0.0 이상 1.0미만의 실수 더블 값을 랜덤하게 나타내어주는 메소드값이다.
		  		즉, 0.0 <= 임의의 난수(실수) < 1.0
		  		
		  		
	  			1 부터 10까지중 랜덤한 정수를 얻어와 본다. (공식)
	  		
	  			랜덤한 정수=(int)(Math.random()*구간범위) + 시작값;
	  			
	  			(int)(0.16142210451898775) * (10-1+1) 	+1  ==>(int)(9.6142210451898775) * (10-1+1) 	+1  ==> 9+1 => 10
	  			(int)(0.804307009396375)   * (10-1+1) 	+1  ==>(int)(9.804307009396375)  * (10-1+1) 	+1  ==> 9+1 => 10
	  			(int)(0.1910070815027859) * (10-1+1)    +1  ==>(int)(1.910070815027859)  * (10-1+1)     +1  ==> 1+1 => 2
	  			(int)(0.6153496552586605) * (10-1+1)    +1
	  			
	  			0.0 <= 임의의 난수(실수) < 1.0
	  			
	  			
	  			
	  			
	  			2 부터 5까지중 랜덤한 정수를 얻어와 본다. (공식)
	  		
	  			랜덤한 정수=(int)(Math.random()*구간범위) + 시작값;
	  			
	  			(int)(0.16142210451898775) * (5-2+1) 	+2  ==>(int)(0.645688418075951)  * 2    ==> 2+1 => 3
	  			(int)(0.804307009396375)   * (5-2+1) 	+2  ==>(int)(9.804307009396375)  * 2	
	  			(int)(0.1910070815027859) * (5-2+1)    +2   ==>(int)(1.910070815027859)  * 2     
	  			(int)(0.6153496552586605) * (5-2+1)    +2
	  			
	  			System.out.println(0.16142210451898775 * 4); 
	  			-------------------------------------------------------------------------------------------------------
	  			

		 */
		
		//랜덤한 정수=(int)(Math.random()*구간범위) + 시작값;
		
		double rnd = Math.random();
		
		int n1 = (int)(rnd*(10-1+1)) + 1;
		int n2 = (int)(rnd*(7-3+1))  + 3;
		char ch = (char)((int)(rnd*('z'-'a'+1))  + 'a');  //int가 되어진 애를 char에 한번더 넣어줌
		
		System.out.println("1부터 10까지중 랜덤하게 발생한 값 : " + n1);
		System.out.println("3부터 7까지중 랜덤하게 발생한 값 : " + n2);
		System.out.println("a부터 z까지중 랜덤하게 발생한 소문자 :  " + ch);
		
		
		
		
		
		System.out.println("\n====== new Random()을 사용한 것 ======");
		
		// ===랜덤한 정수를 뽑아낸다. === //
		// 보안상 Math.random() 보다는 new Random(); 을 사용하는 것이 더 안전하다.
		Random rndom = new Random();
		
		
		//처음 얼마부터 마지막 얼마까지 랜덤한 정수
		// ==> rndom.nextInt(마지막수 - 처음수+1) + 처음수; (공식)
		
		n1 = rndom.nextInt(10 - 1 + 1) + 1;
		n2 = rndom.nextInt(7 - 3 + 1)  + 3;
		ch = (char)(rndom.nextInt('z' - 'a' + 1) + 'a');
		System.out.println("1부터 10까지중 랜덤하게 발생한 값 : " + n1);
		System.out.println("3부터 7까지중 랜덤하게 발생한 값 : " + n2);
		System.out.println("a부터 z까지중 랜덤하게 발생한 소문자 :  " + ch);
		
		
		
		
	
	}//end of main()--------------------

}
